Tekla Open API Reference for Tekla Structures 2025
Operation.ResetAnalysisPartPositions Method
 Reset analysis part. Removes the offsets applied to node positions. The axis offset of the analysis part is not reset.
 Namespace: Tekla.Structures.Analysis.Operations
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static void ResetAnalysisPartPositions(
	AnalysisPart analysisPart
)
Public Shared Sub ResetAnalysisPartPositions (
	analysisPart As AnalysisPart
)
Parameters
analysisPart
Type: Tekla.Structures.Analysis.AnalysisPart
The analysis part.
See Also
Reference
Operation Class
Tekla.Structures.Analysis.Operations Namespace